huskyroboticsteam/Battery_Management_Board_PY2024/BatteryBalance/BatteryBalance.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "INA226_I2C.h"
#include "INA226_I2C_I2C.h"
#include "INA226_I2C_PINS.h"
#include "INA226_I2C_I2C_PVT.h"
#include "INA226_I2C_PVT.h"
#include "INA226_I2C_BOOT.h"
#include "DBG_UART.h"
#include "DBG_UART_SPI_UART.h"
#include "DBG_UART_PINS.h"
#include "DBG_UART_SPI_UART_PVT.h"
#include "DBG_UART_PVT.h"
#include "DBG_UART_BOOT.h"
#include "RX_1.h"
#include "RX_1_aliases.h"
#include "TX_1.h"
#include "TX_1_aliases.h"
#include "CAN.h"
#include "INA226_I2C_SCBCLK.h"
#include "INA226_I2C_sda.h"
#include "INA226_I2C_sda_aliases.h"
#include "INA226_I2C_scl.h"
#include "INA226_I2C_scl_aliases.h"
#include "INA226_I2C_SCB_IRQ.h"
#include "DBG_UART_SCBCLK.h"
#include "DBG_UART_tx.h"
#include "DBG_UART_tx_aliases.h"
#include "DBG_UART_rx.h"
#include "DBG_UART_rx_aliases.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

